import MainSection from "@/components/UI/mainSection/MainSection";
import PageWithAside from "@/components/UI/pageWithAside/PageWithAside";
import ModalButton from "@/components/UI/modalButton/ModalButton";
import ImgContainer from "@/components/UI/imgContainer/ImgContainer";
import ServicesList from "@/components/UI/servicesList/ServicesList";
import ServicesData from "@/data/servicesData";

export default function MilitaryPage() {
  return (
    <>
      <MainSection />
      <PageWithAside>
        <h1>Військове право</h1>
        <p>
          У сучасних умовах багато українців стикаються з правовими питаннями,
          повязаними з військовою службою та захистом своїх прав як
          військовослужбовців чи їхніх сімей. Військовий адвокат – це той
          фахівець, який забезпечить надійний правовий захист у питаннях
          звільнення з військової служби, мобілізації, контрактної служби,
          соціальних гарантій, пільг та захисту прав військових під час служби
          чи після її завершення. Професійна допомога військового адвоката може
          стати ключовим фактором у вирішенні ваших правових проблем.
        </p>
        <h3>Основні обовязки військового адвоката включають:</h3>
        <ul>
          <li>
            Консультації з військового права: Надання правових консультацій з
            питань, повязаних із мобілізацією, проходженням військової служби
            або звільнення з неї, укладанням та розірванням контрактів, правами
            та обовязками військових.
          </li>
          <li>
            Захист прав військовослужбовців: Представництво інтересів у судах,
            військових прокуратурах, дисциплінарних комісіях та інших державних
            органах під час розгляду справ, що стосуються порушень прав,
            незаконного звільнення, притягнення до дисциплінарної чи
            кримінальної відповідальності.
          </li>
          <li>
            Допомога в отриманні соціальних гарантій та пільг: Консультації та
            правовий супровід у питаннях отримання виплат, компенсацій,
            медичного обслуговування, забезпечення житлом, реабілітаційних
            заходів, а також інших соціальних гарантій, передбачених
            законодавством.
          </li>
          <li>
            Супровід у питаннях мобілізації та демобілізації: Захист прав під
            час призову на військову службу, допомога у спорах щодо мобілізації,
            звільнення від служби за станом здоровя чи інших підстав, а також
            супровід процесу демобілізації.
          </li>
          <li>
            Розгляд питань щодо військових злочинів: Захист інтересів клієнтів у
            випадках звинувачення у військових злочинах, таких як дезертирство,
            невиконання наказів, порушення статутних відносин тощо.
          </li>
          <li>
            Правовий супровід поранених військових та сімей загиблих: Допомога в
            отриманні компенсацій, виплат, пенсій, а також представництво
            інтересів у судах у разі спорів щодо цих питань.
          </li>
        </ul>
        <ModalButton className="mx-auto">Contact with me</ModalButton>
        <ImgContainer src="/images/main.webp" alt="voenoe pravo" />
        <p>
          Військовий адвокат – це надійний правовий партнер для тих, хто
          перебуває на службі, проходить мобілізацію чи потребує захисту прав у
          звязку з військовою діяльністю.
        </p>
        <ServicesList
          title="Адвокат з військових питань надає наступні послуги:"
          listData={ServicesData}
          footer="Вказаний вище перелік послуг не є вичерпним"
        />
      </PageWithAside>
    </>
  );
}
