import MainSection from "@/components/UI/mainSection/MainSection";
import PageWithAside from "@/components/UI/pageWithAside/PageWithAside";
import ServicesData from "@/data/servicesData";
import ServicesList from "@/components/UI/servicesList/ServicesList";
import ModalButton from "@/components/UI/modalButton/ModalButton";
import Heading from "@/components/UI/heading/Heading";

export default function FamilyPage() {
  return (
    <>
      <MainSection />
      <PageWithAside>
        <Heading>Сімейні справи</Heading>
        <p>
          Сімейні справи мають унікальну природу, адже вони торкаються майже
          кожної людини. Це питання не тільки юридичного характеру, але й
          морального та етичного змісту. Незалежно від того, яке саме питання
          розглядається — розлучення, поділ майна, встановлення батьківства,
          визначення порядку виховання дітей чи стягнення аліментів — завжди
          важливими є цінності, які лежать в основі цих рішень.
        </p>
        <Heading level="h3" align="start">
          Як адвокат допоможе вам у сімейному праві?
        </Heading>
        <p>
          Адвокат у сфері сімейного права — це спеціаліст, який займається
          вирішенням різноманітних сімейних конфліктів: від розгляду сімейних
          спорів та укладання шлюбних контрактів до встановлення розміру
          аліментів, їх примусового стягнення, визначення опіки над дітьми,
          встановлення батьківства та підготовки необхідної документації, що
          стосується сімейних правовідносин. Такий юрист повинен досконало
          володіти знаннями сімейного кодексу та вміти ефективно використовувати
          норми чинного законодавства на користь свого клієнта.
        </p>
        <Heading level="h3" align="start">
          Чому важливо звернутися до адвоката з сімейного права?
        </Heading>
        <p>
          Сімейні спори є однією з найпоширеніших категорій у цивільному праві.
          Юристи, які спеціалізуються на цій галузі, можуть називати себе
          по-різному: адвокати у сімейних справах, юристи з питань сімейного
          права або адвокати сімейних справ. Незалежно від назви, їх основна
          мета залишається незмінною — вони допомагають вирішувати будь-які
          питання, що виникають у сфері сімейних правовідносин. Звернення до
          адвокату допоможе вам:
        </p>
        <ModalButton className={"mx-auto"}>text</ModalButton>
        <p>
          Адвокат надає юридичні консультації клієнтам як в усній, так і в
          письмовій формі, як дистанційно так і під час особистої зустрічі.
          Послуги адвоката доступні для мешканців будь-якого регіону України.
        </p>
        <ServicesList listData={ServicesData} />
      </PageWithAside>
    </>
  );
}
