import MainSection from "@/components/UI/mainSection/MainSection";
import PageWithAside from "@/components/UI/pageWithAside/PageWithAside";
import ImgContainer from "@/components/UI/imgContainer/ImgContainer";
import ServicesList from "@/components/UI/servicesList/ServicesList";
import ServicesData from "@/data/servicesData";

export default function ViolationPage() {
  return (
    <>
      <MainSection />
      <PageWithAside>
        <h2>Адвокат по справах про адміністративне правопорушення</h2>
        <p>
          Юридична допомога в адміністративних справах користується великим
          попитом, оскільки громадяни щодня мають справу з органами місцевого
          самоврядування, державної влади та правоохоронними органами, чиї дії
          іноді можуть бути неправомірними.
        </p>
        <p>
          Адміністративним правопорушенням (проступком) визнається протиправна,
          винна (умисна або необережна) дія чи бездіяльність, яка посягає на
          громадський порядок, власність, права і свободи громадян, на
          встановлений порядок управління та за яку законом передбачено
          адміністративну відповідальність.
        </p>
        <p>
          Законодавство кожної країни передбачає власні норми, які визначають
          види адміністративних правопорушень та встановлюють відповідальність
          за них. Ці норми, як правило, містяться в окремих законах або
          кодексах. Адміністративне правопорушення зазвичай має місце, коли
          особа порушує вимоги, що забезпечують громадський порядок та безпеку.
          Розгляд справи починається зі складання протоколу або постанови, яку
          оформлюють представники правоохоронних органів чи спеціально
          уповноважені особи. У протоколі фіксуються опис порушення, наявні
          докази та інша важлива інформація. Далі, в залежності від норм
          законодавства, справа може бути передана на розгляд до суду або іншого
          компетентного органу.
        </p>
        <h3>Послуги адвоката в справах про адміністративні правопорушення</h3>
        <ImgContainer src="/images/main.webp" alt="musora" />
        <p>
          Адвокат забезпечить Вас надійним захистом у справах про
          адміністративні правопорушення та розробить правильну стратегію для
          вашого захисту. Також, фахівець в галузі права допоможе зібрати та
          підготувати всі необхідні докази для їх ефективного використання в
          суді. Крім цього, послуги адвоката будуть особливо корисними, коли
          адміністративне порушення може негативно вплинути на професійні чи
          приватні аспекти життя. Наприклад, якщо справа стосується порушення
          правил дорожнього руху, що може стати причиною втрати водійського
          посвідчення. Адвокат докладе максимум зусиль, щоб мінімізувати ці
          наслідки.
        </p>
        <p>
          Адвокат може надати допомогу в зборі необхідних доказів, складанні
          заяв, скарг на порушення ваших прав з боку поліцейських чи інших
          посадовців під час юридичного супроводу справи про адміністративне
          правопорушення, а також забезпечити правову консультацію з інших
          аспектів, повязаних із адміністративною справою.
        </p>
        <p>
          Таким чином, участь адвоката є надзвичайно важливою для забезпечення
          якісної юридичної допомоги і захисту прав та інтересів особи, яка може
          бути притягнута до адміністративної відповідальності.
        </p>
        <h3>Після звернення до адвоката, ви отримаєте:</h3>
        <ul>
          <li>
            Безкоштовні юридичні консультації з питань, що вас цікавлять, в
            категорії справ про адміністративні правопорушення, із врахуванням
            всіх правових аспектів;
          </li>
          <li>Розробку індивідуальної стратегію захисту;</li>
          <li>
            Якісну підготовку процесуальних документів (заяви, клопотання);
          </li>
          <li>
            Представництво ваших інтересів в судах усіх інстанцій, перед
            правоохоронними органами та іншими органами державної влади, без
            вашої участі, заощаджуючи ваш час;
          </li>
          <li>
            Витребування доказів адвокатом на підтвердження факту вашої
            невинуватості;
          </li>
          <li>Надання допомоги в досудовій процедурі врегулювання спору;</li>
        </ul>
        <ServicesList
          listData={ServicesData}
          title="Адвокат по справах про адміністративні правопорушення надає наступні послуги:"
        />
      </PageWithAside>
    </>
  );
}
