import ImgContainer from "@/components/UI/imgContainer/ImgContainer";
import ServicesList from "@/components/UI/servicesList/ServicesList";
import MainSection from "@/components/UI/mainSection/MainSection";
import PageWithAside from "@/components/UI/pageWithAside/PageWithAside";
import ServicesData from "@/data/servicesData";
import Heading from "@/components/UI/heading/Heading";
import { getLocale } from "next-intl/server";
import { BuildServicesData } from "@/data/servicesData";

// 1. Метаданные экспортируем как именованную константу (НЕ default)
export const metadata = {
  title: "Стройка",
};

// 2. Сам компонент ОБЯЗАТЕЛЬНО должен быть export default function
export default async function BuildPage() {
  const locale = await getLocale();
  return (
    <>
      <MainSection />
      <PageWithAside>
        <>
          <Heading>Адвокат з нерухомості та житлових</Heading>
          <p>
            Адвокат у сфері нерухомості – це спеціаліст, який забезпечує захист
            прав та інтересів клієнта під час здійснення правочинів щодо
            нерухомого майна або інших необхідних дій з нерухомістю. Він
            відповідає за правовий супровід договорів та підготовку до їх
            підписання, надаючи необхідну юридичну підтримку у цій сфері. Крім
            цього, адвокат надає юридичну допомогу під час інших спірних питань
            які пов`язані із нерухомим майном.
          </p>
          <p>
            Судові спори щодо нерухомості, як правило, становлять собою
            проблемні ситуації юридичного характеру що виникають внаслідок
            порушення прав сторін правовідносин щодо нерухомого майна. У цих
            суперечках сторони прагнуть захистити свої права та довести свою
            точку зору під час судового розгляду. Спори щодо нерухомості
            зазвичай виникають через посягання на права окремої особи або
            протиправні дії, що призводять до порушення цих прав.
          </p>

          <ImgContainer src={"/images/main.webp"} alt={"just for test"} />

          <Heading level={"h3"} align="start">
            Які існують види порушень пов`язаних з нерухомим майном?
          </Heading>

          <ul className="custom-list-disc-inside">
            <li>Встановлення права власності на самовільно зведений обєкт.</li>
            <li>Розподіл нерухомого майна між співвласниками.</li>
            <li>Скасування договору купівлі-продажу нерухомості</li>
            <li>
              Усунення обмежень у використанні та розпорядженні нерухомістю.
            </li>
            <li>
              Оскарження права власності на нерухомість, отриману у спадок.
            </li>
            <li>Визнання договору оренди нерухомого майна недійсним.</li>
          </ul>
          <Heading level="h3" align="center">
            Вказаний вище перелік послуг не є вичерпним
          </Heading>
          <p>
            Консультація адвоката з питань нерухомості забезпечить впевненість у
            тому, що дії клієнта будуть чітко координуватися професіоналом.
            Адвокат візьме на себе ведення справи на всіх її етапах, включаючи
            підготовку та оформлення необхідних документів.
          </p>

          <Heading level="h3" align="start">
            Адвокат Рясний Владислав Денисович надасть вам юридичну допомогу
            шляхом:
          </Heading>
          <ul className="custom-list-disc-inside">
            <li>
              надасть юридичну консультацію та здійснить розробку індивідуальної
              стратегії вашого захисту;
            </li>
            <li>
              здійснить заходи для досудового врегулювання спору (письмові
              досудові вимоги, претензії та ін.);
            </li>
            <li>
              надасть якісну підготовку процесуальних документів (позовні заяви,
              клопотання, адвокатські запити, тощо);
            </li>
            <li>
              проведе представництво ваших інтересів в судах усіх інстанцій,
              перед правоохоронними органами та іншими органами державної влади,
              без вашої участі, заощаджуючи ваш час;
            </li>
            <li>
              в разі необхідності, здійснить оскарження рішення суду в
              апеляційній та касаційній інстанціях;
            </li>
          </ul>

          <Heading level="h3" align="center">
            Вказаний вище перелік послуг не є вичерпним
          </Heading>

          <Heading>Текущая локаль:{locale}</Heading>

          <ServicesList
            listData={BuildServicesData}
            title={"Послуги адвоката"}
            footer={"Gjckeub fldjrfnf 2"}
            keyGroup={"BuildList"}
          />
        </>
      </PageWithAside>
    </>
  );
}
