import PageWithAside from "@/components/UI/pageWithAside/PageWithAside";
import MainSection from "@/components/UI/mainSection/MainSection";
import ImgContainer from "@/components/UI/imgContainer/ImgContainer";
import ServicesData from "@/data/servicesData";
import ServicesList from "@/components/UI/servicesList/ServicesList";

export default function LawPage() {
  return (
    <>
      <MainSection />
      <PageWithAside>
        <h2 className="custom-h2 text-center md:text-start">
          Адвокат з адміністративних справ
        </h2>
        <p>
          Кожен може зустрітися з незаконними діями (бездіяльністю) з боку
          державного органу чи органу місцевого самоврядування, внаслідок чого
          виникає потреба оскаржуватиїх рішення, дії чи бездіяльність.
        </p>
        <p>
          Адвокат Рясний Владислав Денисович володіє багаторічним досвідом у
          сфері захисту прав і законних інтересів в адміністративних спорах.
          Зазначене дає можливість сформувати надійну правову стратегію для
          клієнта та вжити всі необхідні заходи для досягнення найкращих
          результатів.
        </p>
        <p>
          Для захисту прав та законних інтересів фізичних/або юридичних осіб від
          порушень з боку державних органів, в нашій державі діють
          адміністративні суди.
        </p>
        <ImgContainer src="/images/main.webp" alt="law" />
        <ServicesList
          title="Адвокат надає правову допомогу у наступних справах:"
          listData={ServicesData}
        />
        <p>
          Зазначений перелік послуг адвоката не є вичерпним. Захист може
          здійснюватися й іншими методами, які не суперечать чинному
          законодавству України. Спосіб захисту в кожному конкретному випадку
          обирається індивідуально, залежно від особливостей порушення та
          найдієвішого методу його відновлення.
        </p>
        <h3 className="my-4">
          Юридична допомога адвоката в адміністративних справах полягає в
          наступному:
        </h3>
        <ul className="grid gap-2">
          <li className="hover:text-primary">
            ретельний юридичний аналіз документів та фактичних обставин справи
          </li>
          <li className="hover:text-primary">
            розробка скарг, заяв, клопотань, адвокатських запитів з метою
            з`ясування додаткової інформації
          </li>
          <li className="hover:text-primary">
            підготовка позовної заяви та інших процесуальних документів для
            звернення до суду
          </li>
          <li className="hover:text-primary">
            в разі, якщо в суд подали на вас - складання письмових заперечень
            проти позовної заяви, з метою залишення позовної заяви без
            задоволення
          </li>
          <li className="hover:text-primary">
            представництво інтересів клієнтів в судах усіх інстанцій
          </li>
        </ul>
      </PageWithAside>
    </>
  );
}
