import PageWithAside from "@/components/UI/pageWithAside/PageWithAside";
import MainSection from "@/components/UI/mainSection/MainSection";
import ServicesData from "@/data/servicesData";
import ServicesList from "@/components/UI/servicesList/ServicesList";
import ImgContainer from "@/components/UI/imgContainer/ImgContainer";
import Heading from "@/components/UI/heading/Heading";

export default function WorkerPage() {
  return (
    <>
      <MainSection title="Работа" />
      <PageWithAside>
        <Heading>Адвокат з трудових спорів</Heading>

        <p>
          Право на працю гарантується Конституцією України та регулюється
          багатьма нормативно-правовими актами. Однак, трудові відносини не
          завжди розвиваються без труднощів. Іноді виникають конфлікти з
          роботодавцем або випадки недобросовісної поведінки як з боку
          роботодавця, так і працівника.
        </p>
        <p>
          Грамотний юридичний захист своїх прав у трудових спорах допоможе
          досягти бажаного результату, уникнувши зайвих хвилювань та втрати
          часу.
        </p>
        <p>
          Адвокат з трудових спорів захистить права працівника в разі
          незаконного звільнення, допоможе підтвердити факт існування трудових
          правовідносин, стягнути невиплачену заробітну плату, отримати подвійну
          оплату за роботу у святкові та/або вихідні дні, середній заробіток за
          затримку виплати чи вимушений прогул. Крім того, він допоможе
          оскаржити безпідставні накази щодо накладення дисциплінарних стягнень
          (догани, зниження в посаді, позбавлення премії, тощо) та забезпечить
          поновлення на робочому місці.
        </p>
        <ImgContainer src="/images/main.webp" alt="worker" />
        <p>
          Звернувшись до адвоката Рясного Владислава Денисовича, ви отримаєте
          кваліфікований захист ваших трудових прав, законних інтересів та
          комплексне ведення справи (від підготовки позову до виконання рішення
          суду, без залучення Клієнта в юридичні деталі та судову тяганину).
        </p>

        <Heading level="h3" align="start">
          Крім цього, адвокат:
        </Heading>

        <ul className="custom-list-disc-inside">
          <li>Надасть юридичну консультацію з трудового права;</li>
          <li>Здійснить розробку індивідуальної стратегії вашого захисту;</li>
          <li>
            Надасть якісну підготовку процесуальних документів (позовні заяви,
            клопотання, адвокатські запити, тощо);
          </li>
          <li>
            Проведе представництво ваших інтересів в судах усіх інстанцій, перед
            правоохоронними органами та іншими органами державної влади, без
            вашої участі, заощаджуючи ваш час;
          </li>
          <li>
            В разі необхідності, здійснить оскарження рішення суду в апеляційній
            та касаційній інстанціях;
          </li>
        </ul>
        <ServicesList
          listData={ServicesData}
          title="Послуги"
          footer="Вказаний вище перелік послуг не є вичерпним"
        />
      </PageWithAside>
    </>
  );
}
