import { BsTelephoneInbound } from "react-icons/bs";
import { IoMdSearch } from "react-icons/io";
import { PiBagSimpleLight } from "react-icons/pi";
import { FaRegSquareCheck } from "react-icons/fa6";
import { FaListOl } from "react-icons/fa";
import { GrUserManager } from "react-icons/gr";

const RecomendListData = [
  {
    icon: BsTelephoneInbound,
    text: "Після укладання договору з адвокатом у вас гарантовано буде з ним зворотній зв'язок",
    id: 1,
  },
  {
    icon: IoMdSearch,
    text: "Відсутність голослівних обіцянок. Тільки після детального аналізу індивідуальної ситуації адвокат може вибрати правильну стратегію захисту",
    id: 2,
  },
  {
    icon: PiBagSimpleLight,
    text: "Вузька спеціалізація адвоката. За понад 7 років захисту громадян, адвокат та його команда юристів отримали безцінний досвід, який дозволяє досягти позитивного результату для клієнта",
    id: 3,
  },
  {
    icon: FaRegSquareCheck,
    text: "Правильна юридична стратегія. Способи захисту – перевірені багаторічною практикою. Адвокат докладатиме максимальних зусиль, щоб надати вам потрібний результат",
    id: 4,
  },
  {
    icon: FaListOl,
    text: "Співробітництво засноване на договорі який укладено у письмовій формі. Умови роботи адвоката повністю відображені у договорі. Вся робота здійснюється строго на підставі та в рамках договору",
    id: 5,
  },
  {
    icon: GrUserManager,
    text: "Участь клієнта – необов'язково. Укладаючи договір із нами, адвокат має можливість представляти ваші інтереси в судах усіх інстанцій, перед правоохоронними органами та іншими органами державної влади, без вашої участі, заощаджуючи ваш час",
    id: 6,
  },
];

export default RecomendListData;
