const ServicesData = [
  {
    src: "/",
    text: "Супровід справи про витребування нерухомого майна з чужого незаконного володіння;",
    id: 1,
  },
  {
    src: "/",
    text: "Розірвання договору оренди землі або квартири  (будинку);",
    id: 2,
  },
  {
    src: "/",
    text: "Спори про визнання права власності на нерухоме майно;",
    id: 3,
  },
  { src: "/", text: "Справи про виселення з приміщення;", id: 4 },
  {
    src: "/",
    text: "Скасування договорів з нерухомим майном (купівля-продаж, обмін, дарування, іпотека, оренда, тощо);",
    id: 5,
  },
  {
    src: "/",
    text: "Оформлення самовільно збудованих об'єктів або перепланувань через суд;",
    id: 6,
  },
];

export default ServicesData;
